PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_dma.h
/***************************************
*    In-line Function Implementation
***************************************/


/**
* \addtogroup group_dma_block_functions
* \{
*/


/*******************************************************************************
* Function Name: Cy_DMA_Enable
****************************************************************************//**
*
* Enables the DMA block.
*
* \param base
* The pointer to the hardware DMA block.
*
* \funcusage
* \snippet dma/snippet/main.c snippet_Cy_DMA_Enable
*
*******************************************************************************/
__STATIC_INLINE void Cy_DMA_Enable(DW_Type * base)
{
    DW_CTL(base) |= DW_CTL_ENABLED_Msk;
}


/*******************************************************************************
* Function Name: Cy_DMA_Disable
****************************************************************************//**
*
* Disables the DMA block.
*
* \param base
* The pointer to the hardware DMA block.
*
* \funcusage
* \snippet dma/snippet/main.c snippet_Cy_DMA_Disable
*
*******************************************************************************/
__STATIC_INLINE void Cy_DMA_Disable(DW_Type * base)
{
    DW_CTL(base) &= (uint32_t) ~DW_CTL_ENABLED_Msk;
}


/*******************************************************************************
* Function Name: Cy_DMA_GetActiveChannel
****************************************************************************//**
*
* Returns the status of the active/pending channels in
* the DMA block.
*
* \param base
* The pointer to the hardware DMA block.
*
* \return
* For DW Version 1 based devices,
* returns a bit-field with all of the currently active/pending channels in the
* DMA block.
*
* \note For DW Version 2 based devices,
* returns a bit-field with first 32 channels currently active/pending in the DMA block.
* In addition to this, user can get the active channel index using \ref Cy_DMA_GetActiveChannelIndex.
*
* \funcusage
* \snippet dma/snippet/main.c snippet_Cy_DMA_Disable
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_DMA_GetActiveChannel(DW_Type const * base)
{

#if defined (CY_IP_M4CPUSS_DMA) && (CY_IP_M4CPUSS_DMA_VERSION == 1u)
    /* DW version 1 provides consolidated status of pending and active channels in PENDING register */
    return (DW_PENDING(base));
#else
    /* DW version 2 supports upto 512 channels and cannot fit the status in a 32-bit integer */
    /* Returns bit-field for 32 channels in case more channels are available user to use new API */
    {
        uint32_t channels_pending = 0UL;
        uint32_t max_channels = CY_DMA_CH_NR_AVAILABLE(base);

        /* Get Channel Pending status from individual channel status information */
        CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 14.3', 'channel_nr may be higher or lower than 32 depending on target device.');
        for (uint8_t channel_nr = 0U; (channel_nr < 32U && channel_nr < max_channels); channel_nr++)
        {
            channels_pending |= (_FLD2VAL(DW_CH_STRUCT_CH_STATUS_PENDING, DW_CH_STATUS(base, channel_nr)) << channel_nr);
        }

        return channels_pending;
    }
#endif

}
/*******************************************************************************
* Function Name: Cy_DMA_GetActiveChannelIndex
****************************************************************************//**
*
* Returns the index of the active channel within the DMA block.
*
* \param base
* The pointer to the hardware DMA block.
*
* \return
* active channel index if present otherwise \ref CY_DMA_NO_ACTIVE_CHANNELS
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_DMA_GetActiveChannelIndex(DW_Type const * base)
{
    if (_FLD2VAL(DW_STATUS_ACTIVE, DW_STATUS(base)) == 1U)
    {
        return (_FLD2VAL(CY_DW_STATUS_CH_IDX, DW_STATUS(base)));
    }
    else
    {
        return CY_DMA_NO_ACTIVE_CHANNELS;
    }
}


/*******************************************************************************
* Function Name: Cy_DMA_GetActiveSrcAddress
****************************************************************************//**
*
* Returns the source address being used for the current transfer.
*
* \param base
* The pointer to the hardware DMA block.
*
* \return
* Returns the pointer to the source of transfer.
*
* \funcusage
* \snippet dma/snippet/main.c snippet_Cy_DMA_GetActiveSrcAddress
*
*******************************************************************************/
__STATIC_INLINE void *Cy_DMA_GetActiveSrcAddress(DW_Type const * base)
{
    return ((void *) DW_DESCR_SRC(base));
}


/*******************************************************************************
* Function Name: Cy_DMA_GetActiveDstAddress
****************************************************************************//**
*
* Returns the destination address being used for the current transfer.
*
* \param base
* The pointer to the hardware DMA block.
*
* \return
* Returns the pointer to the destination of transfer.
*
* \funcusage
* \snippet dma/snippet/main.c snippet_Cy_DMA_GetActiveSrcAddress
*
*******************************************************************************/
__STATIC_INLINE void *Cy_DMA_GetActiveDstAddress(DW_Type const * base)
{
    return ((void *) DW_DESCR_DST(base));
}

/** \} group_dma_block_functions */

/**
* \addtogroup group_dma_descriptor_functions
* \{
*/


/*******************************************************************************
* Function Name: Cy_DMA_Descriptor_SetSrcAddress
****************************************************************************//**
*
* Sets the source address for the specified descriptor.
*
* \param descriptor
* The descriptor structure instance declared by the user/component.
*
* \param srcAddress
* The source address value for the descriptor.
* When D-Cache is present and enabled, this data pointer needs to point to 32 bit aligned data.
*
* \funcusage
* \snippet dma/snippet/main.c snippet_Cy_DMA_Descriptor_SetterFunctions
*
*******************************************************************************/
__STATIC_INLINE void Cy_DMA_Descriptor_SetSrcAddress(cy_stc_dma_descriptor_t * descriptor, void const * srcAddress)
{
    descriptor->src = (uint32_t) srcAddress;
}


