PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_dma.h
/*******************************************************************************
* Function Name: Cy_DMA_Channel_SetInterrupt
****************************************************************************//**
*
* Sets the interrupt for the specified channel.
*
* \param base
* The pointer to the hardware DMA block.
*
* \param channel
* The channel number.
*
* \funcusage
* \snippet dma/snippet/main.c snippet_Cy_DMA_SetInterruptMask
*
*******************************************************************************/
__STATIC_INLINE void Cy_DMA_Channel_SetInterrupt(DW_Type * base, uint32_t channel)
{
    CY_ASSERT_L1(CY_DMA_IS_CH_NR_VALID(base, channel));

    DW_CH_INTR_SET(base, channel) = CY_DMA_INTR_MASK;
}


/*******************************************************************************
* Function Name: Cy_DMA_Channel_GetInterruptMask
****************************************************************************//**
*
* Returns the interrupt mask value of the specified channel.
*
* \param base
* The pointer to the hardware DMA block.
*
* \param channel
* The channel number.
*
* \return
* The interrupt mask value.
*
* \funcusage
* \snippet dma/snippet/main.c snippet_Cy_DMA_SetInterruptMask
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_DMA_Channel_GetInterruptMask(DW_Type const * base, uint32_t channel)
{
    CY_ASSERT_L1(CY_DMA_IS_CH_NR_VALID(base, channel));

    return (DW_CH_INTR_MASK(base, channel));
}


/*******************************************************************************
* Function Name: Cy_DMA_Channel_SetInterruptMask
****************************************************************************//**
*
* Sets an interrupt mask value for the specified channel.
*
* \param base
* The pointer to the hardware DMA block.
*
* \param channel
* The channel number.
*
* \param interrupt
* The interrupt mask:
* CY_DMA_INTR_MASK to enable the interrupt or 0UL to disable the interrupt.
*
* \funcusage
* \snippet dma/snippet/main.c snippet_Cy_DMA_SetInterruptMask
*
*******************************************************************************/
__STATIC_INLINE void Cy_DMA_Channel_SetInterruptMask(DW_Type * base, uint32_t channel, uint32_t interrupt)
{
    CY_ASSERT_L1(CY_DMA_IS_CH_NR_VALID(base, channel));
    CY_ASSERT_L2(CY_DMA_IS_INTR_MASK_VALID(interrupt));
    DW_CH_INTR_MASK(base, channel) = interrupt;
}


/*******************************************************************************
* Function Name: Cy_DMA_Channel_GetInterruptStatusMasked
****************************************************************************//**
*
* Returns the logical AND of the corresponding INTR and INTR_MASK fields
* in a single-load operation.
*
* \param base
* The pointer to the hardware DMA block.
*
* \param channel
* The channel number.
*
* \funcusage
* \snippet dma/snippet/main.c snippet_Cy_DMA_ClearInterrupt
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_DMA_Channel_GetInterruptStatusMasked(DW_Type const * base, uint32_t channel)
{
    CY_ASSERT_L1(CY_DMA_IS_CH_NR_VALID(base, channel));

    return (DW_CH_INTR_MASKED(base, channel));
}

#if !(defined (CY_IP_M4CPUSS_DMA) && (CY_IP_M4CPUSS_DMA_VERSION == 1u)) || defined (CY_DOXYGEN)
/*******************************************************************************
* Function Name: Cy_DMA_Channel_SetSWTrigger
****************************************************************************//**
*
* The function is used to set a SW trigger for a channel.
*
* \param base
* The pointer to the hardware DMA block.
*
* \param channel
* The channel number.
*
*
*******************************************************************************/
__STATIC_FORCEINLINE  void Cy_DMA_Channel_SetSWTrigger(DW_Type const * base, uint32_t channel)
{
    CY_ASSERT_L1(CY_DMA_IS_CH_NR_VALID(base, channel));
    CY_REG32_CLR_SET(DW_CH_TR_CMD(base, channel), DW_CH_STRUCT_TR_CMD_ACTIVATE, 1U);
}
#endif /* !(defined (CY_IP_M4CPUSS_DMA) && (CY_IP_M4CPUSS_DMA_VERSION == 1u)) || defined (CY_DOXYGEN) */
/** \} group_dma_channel_functions */

/** \} group_dma_functions */


/** \cond The definitions to support the backward compatibility, do not use them in new designs */

#if(0U != CY_DMA_BWC)

/* Type definitions */
#define cy_stc_dma_chnl_config_t        cy_stc_dma_channel_config_t
#define cy_stc_dma_descr_t              cy_stc_dma_descriptor_t
#define cy_stc_dma_descr_config_t       cy_stc_dma_descriptor_config_t
#define cy_en_dma_trig_type_t           cy_en_dma_trigger_type_t

/* Structure items */
#define DMA_Descriptor                  descriptor
#define deact                           retrigger
#define intrType                        interruptType
#define chStateAtCmplt                  channelState
#define srcTxfrSize                     srcTransferSize
#define destTxfrSize                    dstTransferSize
#define trigoutType                     triggerOutType
#define triginType                      triggerInType
#define descrType                       descriptorType
#define srcAddr                         srcAddress
#define destAddr                        dstAddress
#define srcXincr                        srcXincrement
#define srcYincr                        srcYincrement
#define destXincr                       dstXincrement
#define destYincr                       dstYincrement
#define descrNext                       nextDescriptor

/* Constants */
#define CY_DMA_CH_DISABLED              (CY_DMA_CHANNEL_DISABLED)
#define CY_DMA_CH_ENABLED               (CY_DMA_CHANNEL_ENABLED)

#define CY_DMA_TXFR_SIZE_DATA_SIZE      (CY_DMA_TRANSFER_SIZE_DATA)
#define CY_DMA_TXFR_SIZE_WORD           (CY_DMA_TRANSFER_SIZE_WORD)

#define CY_DMA_INTR_1ELEMENT_CMPLT      (CY_DMA_1ELEMENT)
#define CY_DMA_INTR_X_LOOP_CMPLT        (CY_DMA_X_LOOP)
#define CY_DMA_INTR_DESCR_CMPLT         (CY_DMA_DESCR)
#define CY_DMA_INTR_DESCRCHAIN_CMPLT    (CY_DMA_DESCR_CHAIN)

#define CY_DMA_TRIGOUT_1ELEMENT_CMPLT   (CY_DMA_1ELEMENT)
#define CY_DMA_TRIGOUT_X_LOOP_CMPLT     (CY_DMA_X_LOOP)
#define CY_DMA_TRIGOUT_DESCR_CMPLT      (CY_DMA_DESCR)
#define CY_DMA_TRIGOUT_DESCRCHAIN_CMPLT (CY_DMA_DESCR_CHAIN)

#define CY_DMA_TRIGIN_1ELEMENT          (CY_DMA_1ELEMENT)
#define CY_DMA_TRIGIN_XLOOP             (CY_DMA_X_LOOP)
#define CY_DMA_TRIGIN_DESCR             (CY_DMA_DESCR)
#define CY_DMA_TRIGIN_DESCRCHAIN        (CY_DMA_DESCR_CHAIN)

#define CY_DMA_INVALID_INPUT_PARAMETERS (CY_DMA_BAD_PARAM)

#define CY_DMA_RETDIG_IM                (CY_DMA_RETRIG_IM)
#define CY_DMA_RETDIG_4CYC              (CY_DMA_RETRIG_4CYC)
#define CY_DMA_RETDIG_16CYC             (CY_DMA_RETRIG_16CYC)

/* Descriptor structure items */
#define DESCR_CTL                       ctl
#define DESCR_SRC                       src
#define DESCR_DST                       dst
#define DESCR_X_CTL                     xCtl
#define DESCR_Y_CTL                     yCtl
#define DESCR_NEXT_PTR                  nextPtr

/* Descriptor structure bitfields */
#define DW_DESCR_STRUCT_DESCR_CTL_WAIT_FOR_DEACT_Pos 0UL
#define DW_DESCR_STRUCT_DESCR_CTL_WAIT_FOR_DEACT_Msk 0x3UL
#define DW_DESCR_STRUCT_DESCR_CTL_INTR_TYPE_Pos 2UL
#define DW_DESCR_STRUCT_DESCR_CTL_INTR_TYPE_Msk 0xCUL
#define DW_DESCR_STRUCT_DESCR_CTL_TR_OUT_TYPE_Pos 4UL
#define DW_DESCR_STRUCT_DESCR_CTL_TR_OUT_TYPE_Msk 0x30UL
#define DW_DESCR_STRUCT_DESCR_CTL_TR_IN_TYPE_Pos 6UL
#define DW_DESCR_STRUCT_DESCR_CTL_TR_IN_TYPE_Msk 0xC0UL
#define DW_DESCR_STRUCT_DESCR_CTL_CH_DISABLE_Pos 24UL
#define DW_DESCR_STRUCT_DESCR_CTL_CH_DISABLE_Msk 0x1000000UL
#define DW_DESCR_STRUCT_DESCR_CTL_SRC_TRANSFER_SIZE_Pos 26UL
#define DW_DESCR_STRUCT_DESCR_CTL_SRC_TRANSFER_SIZE_Msk 0x4000000UL
#define DW_DESCR_STRUCT_DESCR_CTL_DST_TRANSFER_SIZE_Pos 27UL
#define DW_DESCR_STRUCT_DESCR_CTL_DST_TRANSFER_SIZE_Msk 0x8000000UL
#define DW_DESCR_STRUCT_DESCR_CTL_DATA_SIZE_Pos 28UL
#define DW_DESCR_STRUCT_DESCR_CTL_DATA_SIZE_Msk 0x30000000UL
#define DW_DESCR_STRUCT_DESCR_CTL_DESCR_TYPE_Pos 30UL
#define DW_DESCR_STRUCT_DESCR_CTL_DESCR_TYPE_Msk 0xC0000000UL
#define DW_DESCR_STRUCT_DESCR_SRC_SRC_ADDR_Pos  0UL
#define DW_DESCR_STRUCT_DESCR_SRC_SRC_ADDR_Msk  0xFFFFFFFFUL
#define DW_DESCR_STRUCT_DESCR_DST_DST_ADDR_Pos  0UL
#define DW_DESCR_STRUCT_DESCR_DST_DST_ADDR_Msk  0xFFFFFFFFUL
#define DW_DESCR_STRUCT_DESCR_X_CTL_SRC_X_INCR_Pos 0UL
#define DW_DESCR_STRUCT_DESCR_X_CTL_SRC_X_INCR_Msk 0xFFFUL
#define DW_DESCR_STRUCT_DESCR_X_CTL_DST_X_INCR_Pos 12UL
#define DW_DESCR_STRUCT_DESCR_X_CTL_DST_X_INCR_Msk 0xFFF000UL
#define DW_DESCR_STRUCT_DESCR_X_CTL_X_COUNT_Pos 24UL
#define DW_DESCR_STRUCT_DESCR_X_CTL_X_COUNT_Msk 0xFF000000UL
#define DW_DESCR_STRUCT_DESCR_Y_CTL_SRC_Y_INCR_Pos 0UL
#define DW_DESCR_STRUCT_DESCR_Y_CTL_SRC_Y_INCR_Msk 0xFFFUL
#define DW_DESCR_STRUCT_DESCR_Y_CTL_DST_Y_INCR_Pos 12UL
#define DW_DESCR_STRUCT_DESCR_Y_CTL_DST_Y_INCR_Msk 0xFFF000UL
#define DW_DESCR_STRUCT_DESCR_Y_CTL_Y_COUNT_Pos 24UL
#define DW_DESCR_STRUCT_DESCR_Y_CTL_Y_COUNT_Msk 0xFF000000UL
#define DW_DESCR_STRUCT_DESCR_NEXT_PTR_ADDR_Pos 2UL
#define DW_DESCR_STRUCT_DESCR_NEXT_PTR_ADDR_Msk 0xFFFFFFFCUL

/* Functions */
#define Cy_DMA_GetActiveChnl            Cy_DMA_GetActiveChannel
#define Cy_DMA_GetActiveSrcAddr         Cy_DMA_GetActiveSrcAddress
#define Cy_DMA_GetActiveDstAddr         Cy_DMA_GetActiveDstAddress
#define Cy_DMA_Descr_Init               Cy_DMA_Descriptor_Init
#define Cy_DMA_Descr_DeInit             Cy_DMA_Descriptor_DeInit
#define Cy_DMA_Descr_SetSrcAddr         Cy_DMA_Descriptor_SetSrcAddress
#define Cy_DMA_Descr_SetDestAddr        Cy_DMA_Descriptor_SetDstAddress
#define Cy_DMA_Descr_SetNxtDescr        Cy_DMA_Descriptor_SetNextDescriptor
#define Cy_DMA_Descr_SetIntrType        Cy_DMA_Descriptor_SetInterruptType
#define Cy_DMA_Descr_SetTrigInType      Cy_DMA_Descriptor_SetTriggerInType
#define Cy_DMA_Descr_SetTrigOutType     Cy_DMA_Descriptor_SetTriggerOutType
#define Cy_DMA_Chnl_Init                Cy_DMA_Channel_Init
#define Cy_DMA_Chnl_DeInit              Cy_DMA_Channel_DeInit
#define Cy_DMA_Chnl_SetDescr            Cy_DMA_Channel_SetDescriptor
#define Cy_DMA_Chnl_Enable              Cy_DMA_Channel_Enable
#define Cy_DMA_Chnl_Disable             Cy_DMA_Channel_Disable
#define Cy_DMA_Chnl_GetCurrentDescr     Cy_DMA_Channel_GetCurrentDescriptor
#define Cy_DMA_Chnl_SetPriority         Cy_DMA_Channel_SetPriority
#define Cy_DMA_Chnl_GetPriority         Cy_DMA_Channel_GetPriority
#define Cy_DMA_Chnl_GetInterruptStatus  Cy_DMA_Channel_GetInterruptStatus
#define Cy_DMA_Chnl_GetInterruptCause   Cy_DMA_Channel_GetStatus
#define Cy_DMA_Chnl_ClearInterrupt      Cy_DMA_Channel_ClearInterrupt
#define Cy_DMA_Chnl_SetInterrupt        Cy_DMA_Channel_SetInterrupt
#define Cy_DMA_Chnl_GetInterruptMask    Cy_DMA_Channel_GetInterruptMask
#define Cy_DMA_Chnl_GetInterruptStatusMasked Cy_DMA_Channel_GetInterruptStatusMasked
#define Cy_DMA_Chnl_SetInterruptMask(base, channel) (Cy_DMA_Channel_SetInterruptMask(base, channel, CY_DMA_INTR_MASK))


/*******************************************************************************
* Function Name: Cy_DMA_Descr_SetTxfrWidth
****************************************************************************//**
* This is a legacy API function. It is left here just for backward compatibility.
* Do not use it in new designs.
*******************************************************************************/
__STATIC_INLINE void Cy_DMA_Descr_SetTxfrWidth(cy_stc_dma_descr_t * descriptor,
        uint32_t dataElementSize,
        uint32_t srcTxfrWidth,
        uint32_t dstTxfrWidth)
{
    uint32_t regValue;
    regValue = descriptor->ctl & ((uint32_t)(~(DW_DESCR_STRUCT_DESCR_CTL_DATA_SIZE_Msk |
                                  DW_DESCR_STRUCT_DESCR_CTL_SRC_TRANSFER_SIZE_Msk |
                                  DW_DESCR_STRUCT_DESCR_CTL_DST_TRANSFER_SIZE_Msk)));

    descriptor->ctl = regValue |
                      _VAL2FLD(DW_DESCR_STRUCT_DESCR_CTL_DATA_SIZE, dataElementSize) |
                      _VAL2FLD(DW_DESCR_STRUCT_DESCR_CTL_SRC_TRANSFER_SIZE, srcTxfrWidth) |
                      _VAL2FLD(DW_DESCR_STRUCT_DESCR_CTL_DST_TRANSFER_SIZE, dstTxfrWidth);
}

#endif /* CY_DMA_BWC */

/** \endcond */

CY_MISRA_BLOCK_END('MISRA C-2012 Rule 10.8')

#if defined(__cplusplus)
}
#endif

#endif /* CY_IP_M4CPUSS_DMA, CY_IP_MXDW */

#endif  /* (CY_DMA_H) */

/** \} group_dma */


/* [] END OF FILE */
